In [4]:
import pandas as pd
import numpy as np

In [5]:
data = pd.Series(np.random.randn(9),
                ......:index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                ......:[1,2,3,1,3,1,2,2,3]])

In [6]:
data

a  1   -1.535637
   2   -0.390467
   3    0.249586
b  1   -0.671051
   3   -0.023232
c  1    3.030407
   2   -0.788033
d  2   -0.458166
   3   -0.857938
dtype: float64

In [7]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [8]:
data['b']

1   -0.671051
3   -0.023232
dtype: float64

In [9]:
data['b':'c']

b  1   -0.671051
   3   -0.023232
c  1    3.030407
   2   -0.788033
dtype: float64

In [10]:
data.loc[['b','d']]

b  1   -0.671051
   3   -0.023232
d  2   -0.458166
   3   -0.857938
dtype: float64

In [11]:
data.loc[:,2]

a   -0.390467
c   -0.788033
d   -0.458166
dtype: float64

In [12]:
data.unstack()

          1         2         3
a -1.535637 -0.390467  0.249586
b -0.671051       NaN -0.023232
c  3.030407 -0.788033       NaN
d       NaN -0.458166 -0.857938

In [13]:
data.unstack().stack()

a  1   -1.535637
   2   -0.390467
   3    0.249586
b  1   -0.671051
   3   -0.023232
c  1    3.030407
   2   -0.788033
d  2   -0.458166
   3   -0.857938
dtype: float64

In [15]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    ......:index=[['a', 'a', 'b', 'b',], [1, 2, 1, 2]],
                    ......:columns=[['Toscana', 'Toscana', 'Roma'],
                    ......:['Green', 'Black', 'Green']])

In [16]:
frame

    Toscana        Roma
      Green Black Green
a 1       0     1     2
  2       3     4     5
b 1       6     7     8
  2       9    10    11

In [17]:
frame.index.names = ['key1', 'key2']

In [18]:
frame.columns.names = ['state', 'color']

In [19]:
frame

state     Toscana        Roma
color       Green Black Green
key1 key2
a    1          0     1     2
     2          3     4     5
b    1          6     7     8
     2          9    10    11

In [20]:
frame['Toscana']

color      Green  Black
key1 key2
a    1         0      1
     2         3      4
b    1         6      7
     2         9     10

In [22]:
frame.swaplevel('key1', 'key2')

state     Toscana        Roma
color       Green Black Green
key2 key1
1    a          0     1     2
2    a          3     4     5
1    b          6     7     8
2    b          9    10    11

In [23]:
frame.sort_index(level=1)

state     Toscana        Roma
color       Green Black Green
key1 key2
a    1          0     1     2
b    1          6     7     8
a    2          3     4     5
b    2          9    10    11

In [24]:
frame.swaplevel(0, 1).sort_index(level=0)

state     Toscana        Roma
color       Green Black Green
key2 key1
1    a          0     1     2
     b          6     7     8
2    a          3     4     5
     b          9    10    11

In [27]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      ......: 'c': ['one', 'one', 'one', 'two', 'two',
                      ......: 'two', 'two'],
                      ......: 'd': [0, 1, 2, 0, 1, 2, 3]})

In [28]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [29]:
frame2 = frame.set_index(['c', 'd'])

In [30]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [31]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [32]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [33]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    ......: 'data1': range(7)})

In [34]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    ......: 'data2': range(3)})

In [35]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [36]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [37]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [38]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [39]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    ......: 'data1': range(7)})

In [40]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    ......: 'data2': range(3)})

In [41]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [42]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   a    2.0    0.0
1   a    4.0    0.0
2   a    5.0    0.0
3   b    0.0    1.0
4   b    1.0    1.0
5   b    6.0    1.0
6   c    3.0    NaN
7   d    NaN    2.0

In [43]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    ......: 'data1': range(6)})

In [44]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    ......: 'data2': range(5)})

In [45]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [46]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [47]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [48]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     ......: 'key2': ['one', 'two', 'one'],
                     ......: 'lval': [1, 2, 3]})

In [49]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      ......: 'key2': ['one', 'one', 'one', 'two'],
                      ......: 'rval': [4, 5, 6, 7]})

In [50]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  bar  one   3.0   6.0
1  bar  two   NaN   7.0
2  foo  one   1.0   4.0
3  foo  one   1.0   5.0
4  foo  two   2.0   NaN

In [51]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [52]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [53]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      ......: 'value': range(6)})

In [54]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [55]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [56]:
right1

   group_val
a        3.5
b        7.0

In [57]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0

In [58]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [59]:
lefth = pd.DataFrame({'key1': ['Toscana', 'Toscana', 'Toscana',
                               ......: 'Roma', 'Roma'],
                               ......: 'key2': [2000, 2001, 2002, 2001, 2002],
                               ......: 'data': np.arange(5.)})

In [60]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      ......: index=[['Toscana', 'Toscana', 'Roma', 'Roma',
                      ......: 'Roma', 'Roma'],
                      ......: [2001, 2000, 2000, 2000, 2001, 2002]],
                      ......: columns=['event1', 'event2'])

In [61]:
lefth

      key1  key2  data
0  Toscana  2000   0.0
1  Toscana  2001   1.0
2  Toscana  2002   2.0
3     Roma  2001   3.0
4     Roma  2002   4.0

In [62]:
righth

              event1  event2
Toscana 2001       0       1
        2000       2       3
Roma    2000       4       5
        2000       6       7
        2001       8       9
        2002      10      11

In [63]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

      key1  key2  data  event1  event2
0  Toscana  2000   0.0       2       3
1  Toscana  2001   1.0       0       1
3     Roma  2001   3.0       8       9
4     Roma  2002   4.0      10      11

In [64]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         ......: right_index=True, how='outer')

      key1  key2  data  event1  event2
4     Roma  2000   NaN     4.0     5.0
4     Roma  2000   NaN     6.0     7.0
3     Roma  2001   3.0     8.0     9.0
4     Roma  2002   4.0    10.0    11.0
0  Toscana  2000   0.0     2.0     3.0
1  Toscana  2001   1.0     0.0     1.0
2  Toscana  2002   2.0     NaN     NaN

In [65]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     ......: index=['a', 'c', 'e'],
                     ......: columns=['Ohio', 'Nevada'])

In [66]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                        ......: index=['b', 'c', 'd', 'e'],
                        ......: columns=['Missouri', 'Alabama'])

In [67]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [68]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [69]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [70]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [71]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [73]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                        ......: index=['a', 'c', 'e', 'f'],
                        ......: columns=['New York', 'Oregon'])

In [74]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [75]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [76]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

In [77]:
arr = np.arange(12).reshape((3, 4))

In [78]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [79]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [80]:
s1 = pd.Series([0, 1], index=['a', 'b'])

In [81]:
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

In [82]:
s3 = pd.Series([5, 6], index=['f', 'g'])

In [83]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [84]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [85]:
s4 = pd.concat([s1, s3])

In [86]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [87]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [88]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [90]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])

In [91]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [92]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [93]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [94]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                   ......: columns=['one', 'two'])

In [97]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                   ......: columns=['three', 'four'])

In [98]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [99]:
df2

   three  four
a      5     6
c      7     8

In [100]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [101]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [102]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
          .......: names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [103]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

In [104]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [105]:
df1

          a         b         c         d
0 -1.458402  0.686105 -0.087790  0.575051
1  0.906585 -0.591020  0.550968  0.761216
2  1.002948 -0.514027  0.927940  0.800410

In [106]:
df2

          b         d         a
0 -0.721745  2.084283 -0.590456
1 -0.339559 -1.106612  1.024418

In [107]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -1.458402  0.686105 -0.087790  0.575051
1  0.906585 -0.591020  0.550968  0.761216
2  1.002948 -0.514027  0.927940  0.800410
3 -0.590456 -0.721745       NaN  2.084283
4  1.024418 -0.339559       NaN -1.106612

In [108]:
a = pd.Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan],
               .......: index=['f', 'e', 'd', 'c', 'b', 'a'])

In [109]:
b = pd.Series([0., np.nan, 2., np.nan, np.nan, 5.],
               .......: index=['a', 'b', 'c', 'd', 'e', 'f'])

In [110]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [111]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [112]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [113]:
b.combine_first(a)

a    0.0
b    4.5
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

In [114]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    ......: 'b': [np.nan, 2., np.nan, 6.],
                    ......: 'c': range(2, 18, 4)})

In [115]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    ......: 'b': [np.nan, 3., 4., 6., 8.]})

In [116]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [117]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [118]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [136]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    ......: index=pd.Index(['Roma', 'Toscana'], name='state'),
                    ......: columns=pd.Index(['one', 'two', 'three'],
                    ......: name='number'))

In [137]:
data

number   one  two  three
state
Roma       0    1      2
Toscana    3    4      5

In [138]:
result = data.stack()

In [139]:
result

state    number
Roma     one       0
         two       1
         three     2
Toscana  one       3
         two       4
         three     5
dtype: int64

In [140]:
result.unstack()

number   one  two  three
state
Roma       0    1      2
Toscana    3    4      5

In [141]:
result.unstack(0)

state   Roma  Toscana
number
one        0        3
two        1        4
three      2        5

In [142]:
result.unstack('state')

state   Roma  Toscana
number
one        0        3
two        1        4
three      2        5

In [143]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])

In [144]:
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [145]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [146]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [147]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [148]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [149]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [150]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                   ......: columns=pd.Index(['left', 'right'], name='side'))

In [151]:
df

side            left  right
state   number
Roma    one        0      5
        two        1      6
        three      2      7
Toscana one        3      8
        two        4      9
        three      5     10

In [152]:
df.unstack('state')

side   left         right
state  Roma Toscana  Roma Toscana
number
one       0       3     5       8
two       1       4     6       9
three     2       5     7      10

In [153]:
df.unstack('state').stack('side')

state         Roma  Toscana
number side
one    left      0        3
       right     5        8
two    left      1        4
       right     6        9
three  left      2        5
       right     7       10